'''Сформувати функцію, що буде обчислювати факторіал заданого користувачем
натурального числа n через рекурсію
Гармідер Анастасія 122В'''
import timeit
def d(o):#створюємо цикл для виведення на кожному етапі
    v = 1 #лічильник
    while o > 1:
        v *= o #рекурсія
        o -= 1
    return v
k = int(input('Введіть число:'))
print('Факторіал вашого числа:')
print(d(k))
t = timeit.timeit('"-".join(str(n) for n in range(100))', number=9999)
print(f'Програма працювала {t} секунд')

''''-------------------------------------------------------------------------'''''

def b(a): #створюємо цикл для виведення на кожному етапі
    if a == 0:
        return 1
    else:
        return b (a-1) * a # тобто сама через себе
c = int(input('Введіть число:'))
print('Факторіал вашого числа:')
print(b (c))
t = timeit.timeit('"-".join(str(n) for n in range(100))', number=9999)
print(f'Програма працювала {t} секунд')


'''Написання другої програми зайняло на 15 хвилин менше, також читабельність другої програми краща. 
І по струкруті 2 програма менша ніж 1 '''
'''''Щодо часу виконання у цих програмах то рекурсія працює швидше, а ось щодо пам'яті то ітерація 
займай тріжки менше ніж рекурсія  '''''